benchmark/logs/parallels/400Parallels/ApacheBench.txt
root@ubuntu:~# ab -n 5000 -c 400 benchmark-machinegun-service.default.svc.cluster.local:8080/send?destination="http://target/myPath"
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking benchmark-machinegun-service.default.svc.cluster.local (be patient)
Completed 500 requests
Completed 1000 requests
Completed 1500 requests
Completed 2000 requests
Completed 2500 requests
Completed 3000 requests
Completed 3500 requests
Completed 4000 requests
Completed 4500 requests
Completed 5000 requests
Finished 5000 requests


Server Software:
Server Hostname:        benchmark-machinegun-service.default.svc.cluster.local
Server Port:            8080

Document Path:          /send?destination=http://target/myPath
Document Length:        39 bytes

Concurrency Level:      400
Time taken for tests:   10.802 seconds
Complete requests:      5000
Failed requests:        0
Total transferred:      1195000 bytes
HTML transferred:       195000 bytes
Requests per second:    462.86 [#/sec] (mean)
Time per request:       864.188 [ms] (mean)
Time per request:       2.160 [ms] (mean, across all concurrent requests)
Transfer rate:          108.03 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    6   8.1      3      46
Processing:    32  843 134.5    853    1196
Waiting:        4  726 125.1    722    1074
Total:         32  849 134.0    860    1196

Percentage of the requests served within a certain time (ms)
  50%    860
  66%    900
  75%    924
  80%    952
  90%   1012
  95%   1078
  98%   1176
  99%   1185
 100%   1196 (longest request)